20251023T173743--kdoc-477-『docker-kubernetesネットワークのしくみ』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T16:37:57Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 477: 『Docker-Kubernetesネットワークのしくみ』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 477: 『Docker-Kubernetesネットワークのしくみ』</h1>
<div id="outline-container-orgc2012eb" class="outline-2">
<h2 id="orgc2012eb"><a href="#orgc2012eb">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgc2012eb">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0c89223" class="outline-2">
<h2 id="org0c89223"><a href="#org0c89223">概要</a></h2>
</div>
<div id="outline-container-orgccc6682" class="outline-2">
<h2 id="orgccc6682"><a href="#orgccc6682">メモ</a></h2>
<div class="outline-text-2" id="text-orgccc6682">
<ul class="org-ul">
<li>VXLANはVLANの拡張で、大規模なネットワークを仮想的に分割できる。EthernetフレームをUDP/IPパケットでカプセル化する。このカプセル化により、Ethernetフレームは自身のIPアドレスやMACアドレスを変更することなく、異なるネットワークセグメント間を移動できポータビリティが向上する(p15)</li>
<li>Networ Namespace(netns)を使用することでネットワークスタックを異なるNamespaceに分離し、互いに独立して動作させられる(p15)</li>
</ul>

<div class="org-src-container">
<pre class="src src-nil">アプリ
  - HTTP

|
| システムコール
v------

カーネル
  - TCP
  - IP
  - Ethernet
|
|------
v
- ハードウェア
  - NIC
</pre>
</div>

<ul class="org-ul">
<li>ソケットにはIPアドレスとポート番号の組み合わせが記録され、通信元と通信先を指定している(p19)</li>
<li>3way handshake のメリット(p20)
<ul class="org-ul">
<li>相手先に転送を始めることを通知できる</li>
<li>要求のあったポートを受け入れられるかチェックできる</li>
<li>再送制御や流量制御ができる</li>
</ul></li>
<li>IP層の役割は、TCP層から受け取ったデータにIPパケットを付与し、下位レイヤのL2にデータを送ること(p21)</li>
<li>ルーティングテーブルはルーティングプロトコルによって作成され、パケットが目的地に到達するための最良の経路を記録するしくみになっている。ルーティングプロトコルにはRIP, OSPF, BGPなどがある(p24)</li>
<li>Dockerではdocker0という仮想ブリッジがデフォルトで設定されている。このブリッジはコンテナが外部と通信するためのゲートウェイの役割を果たす(p25)</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">apt install bridge-utils
brctl show docker0
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">bridge name	bridge id		STP enabled	interfaces
docker0		8000.0242014087d9	no		veth8461c84
							vethd66994d
</pre>
</div>

<ul class="org-ul">
<li>VLANは、物理ポートにIDを設定し、セグメントを分ける技術である。VLANを使わない場合は１つのスイッチに対して１つのセグメントしか設定できない(p34)</li>
<li>VLANの利点の１つは、複数のスイッチにまたがっても同一セグメント(Ethernetフレームをもとに通信が行われる範囲)として扱えることである。複数のスイッチを連携させて１つの大規模なL2ネットワークを構築できる。Ethernetフレームだけを見るのでIPアドレスのセグメントは変わらない(p34)</li>
<li>VXLANとは、同じL2ネットワーク上のEthernetフレームをL3ネットワークを介して送り届けられる技術である(p35)</li>
<li>パケットはネットワークデバイスを通過するときルーティングのためにそのパケットのヘッダ情報が書き換えられる(p36)</li>
<li>VXLANはL3ネットワーク上に仮想的なL2ネットワークを作り出すことからネットワークオーバーレイと呼ばれる(p35)</li>
<li>VXLANはEthernetフレームをUDP/IPでカプセル化するため、元のEthernetフレームの外側にさらにEthernetヘッダやIPヘッダがつけられる。これを「外部ヘッダ」という。もともとのEthernetフレーム内のヘッダは「内部ヘッダ」という(p35)</li>
<li>iptables の項目(p55)
<ul class="org-ul">
<li>テーブル: 処理機能を設定する</li>
<li>チェイン: ルールを適用するタイミングを設定する</li>
<li>ターゲット: iptablesルールに一致したパケットに対してどのようなアクションを取るか定義する</li>
</ul></li>
<li>PREROUTINGチェインによるNAT変換が行われたあとにINPUT, OUTPUT, FORWARDが適用される。そのためフィルタリングルールを設定するときにはNAT変換後の情報を使うことが重要である(p57)</li>
<li>iptables から、Dockerをインストールした状態のチェインの流れを図示する(p60)</li>
<li>natテーブルのPOSTROUTINGチェインで、送信元アドレスはホストインターフェースのIPアドレスに変換される。インターネット上のデバイスやサーバはDockerコンテナのIPアドレスを知らず、ホストのIPアドレスしか知らないから変換が必要になる</li>
<li>ホストのIP:8888へのアクセスがコンテナのIP:80に割り振られるような場合、NAPTで変換が実行されている(p67)</li>
<li>Dockerをインストールした直後はデフォルトで3種類のネットワークが作成される(p74)
<ul class="org-ul">
<li>bridge: デフォルトで作成されるネットワーク。コンテナを起動するときネットワークを指定しないとデフォルトでこのネットワークに所属する</li>
<li>host: ホストのネットワーク。ホストと同じネットワークにコンテナを所属させる</li>
<li>none: どのネットワークにも所属させない</li>
</ul></li>
<li>ip netns コマンドはネットワーク名前空間の作成、削除、表示が主な機能であるのに対し、nsenterコマンドはネットワークのみならずプロセスやユーザなどさまざまなタイプの名前空間に入るために使用される(p77)</li>
<li>macvlan ドライバを使うとコンテナに独自のMACアドレスを割り当てられる。これにより、物理ネットワーク上でコンテナを直接通信させられる(p81)</li>
<li>外部からリクエストしてコンテナに流れていく様子(p98)</li>
<li>ポートフォワードは送信先/元IPの管理が必要である。オーバーレイネットワークの場合はあらかじめ環境を構築すればそのあとはコンテナのIPアドレスを指定するだけで通信でき、ホストのIPアドレスは不要となる(p113)</li>
</ul>

<p>
疑問や感想。
</p>

<ul class="org-ul">
<li>ブリッジ・スイッチ・ルーターの違い</li>
<li>フレームとパケットの違い</li>
<li>コンテナにもMACアドレスがある</li>
<li>コンテナのフラッティングとARPの違いがわからない(p27)</li>
<li>veth がよくわからないな</li>
<li>解説の薄い用語の整理
<ul class="org-ul">
<li>enX0: 物理NIC &#x2013; 実際のネットワークへの接続</li>
<li>vxlan0: 仮想トンネル/VXLAN &#x2013; L2 を L3 上で運ぶ overlay network</li>
<li>bridge: 仮想スイッチ &#x2013; L2スイッチ。ケーブルが集まるハブ</li>
<li>veth: 仮想ケーブル/ペア &#x2013; namespace / コンテナとの接続</li>
</ul></li>
<li>vxlan: 別のホスト間でL2ネットワークを拡張したい</li>
<li>bridge: 複数のvethをまとめる、振り分ける</li>
<li>veth: 同一ホスト内で異なるネットワーク名前空間を接続したい</li>
</ul>
</div>
</div>
<div id="outline-container-org4d8f760" class="outline-2">
<h2 id="org4d8f760"><a href="#org4d8f760">関連</a></h2>
<div class="outline-text-2" id="text-org4d8f760">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
